#+TITLE: Benchmarking Notes

This contains notes on running benchmarks on these binaries. Generally
this is test the speed of QEMU and it's emulation code.

* Run Benchmark
:PROPERTIES:
:header-args: :var files=final-test :var tests="float32-add float64-add float32-mul float64-mul float32-div float64-div"
:END:

This runs the benchmark against each binary we have selected above.

#+name: compare-qemu-binaries
#+header: :var workbook=(file-name-directory (buffer-file-name))
#+begin_src python :async
  import subprocess
  import os

  runs=[]

  for qemu,logname in files:
     cmd="taskset -c 0 %s ./vector-benchmark -n %s | tee %s" % (qemu, tests, logname)
     subprocess.call(cmd, shell=True)
     runs.append(logname)

  return runs
#+end_src

#+RESULTS: compare-qemu-binaries
| system-2.5.log | master.log | softfloat-v4.log |

* Upload PNG

This is a simple restful script to upload to imgur. While restful-mode
is intended for live checking of REST APIs it can easily be embedded
in an org-babel source block.

#+name: upload-to-imgur
#+header: :var output=plot-results()
#+begin_src restclient
:client_id = fd2da649643c743

# Upload images to imgur
POST https://api.imgur.com/3/image
Authorization: Client-ID :client_id
Content-type: image/png

< benchmark.png
#+end_src

This is a simple helper function to call the above code but strip out
the URL so you don't need to hunt through all the headers.

#+name: post-to-imgur
#+begin_src emacs-lisp :var json-string=upload-to-imgur()
  (when (string-match
         (rx "link" (one-or-more (any "\":" whitespace))
             (group (one-or-more (not (any "\"")))))
         json-string)
    (match-string 1 json-string))
#+end_src

#+RESULTS: post-to-imgur
: https://i.imgur.com/KMWceo8.png
